lecture_code/app/views/characters/_form.html.erb

SELECT "movies".* FROM "movies"
---
    <%= f.label :movie_id %><br />
    <%= f.collection_select :movie_id,
                            Movie.all,
                            :id,
                            :title %>