lecture_code/app/views/movies/show.html.erb

<ul>
  <% @movie.characters.each do |c| %>
---
SELECT "characters".* FROM "characters" WHERE "characters"."movie_id" = 7